loadtest/results/ballerina-get.txt

Summary:
  Total:	30.0143 secs
  Slowest:	0.0438 secs
  Fastest:	0.0086 secs
  Average:	0.0185 secs
  Requests/sec:	2697.9429
  

Response time histogram:
  0.009 [1]	|
  0.012 [5625]	|■■■■■
  0.016 [3052]	|■■■
  0.019 [43575]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.023 [17285]	|■■■■■■■■■■■■■■■■
  0.026 [8473]	|■■■■■■■■
  0.030 [2314]	|■■
  0.033 [538]	|
  0.037 [103]	|
  0.040 [8]	|
  0.044 [3]	|


Latency distribution:
  10%% in 0.0154 secs
  25%% in 0.0164 secs
  50%% in 0.0173 secs
  75%% in 0.0216 secs
  90%% in 0.0236 secs
  95%% in 0.0250 secs
  99%% in 0.0293 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0017 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0006 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0185 secs, 0.0079 secs, 0.0438 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0006 secs

Status code distribution:
  [200]	80977 responses