loadtest/results/ballerina-get.txt

Summary:
  Total:	30.0097 secs
  Slowest:	0.1482 secs
  Fastest:	0.0037 secs
  Average:	0.0144 secs
  Requests/sec:	3478.8055
  

Response time histogram:
  0.004 [1]	|
  0.018 [90653]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.033 [13116]	|■■■■■■
  0.047 [331]	|
  0.062 [134]	|
  0.076 [64]	|
  0.090 [44]	|
  0.105 [20]	|
  0.119 [16]	|
  0.134 [11]	|
  0.148 [8]	|


Latency distribution:
  10%% in 0.0107 secs
  25%% in 0.0113 secs
  50%% in 0.0142 secs
  75%% in 0.0161 secs
  90%% in 0.0189 secs
  95%% in 0.0209 secs
  99%% in 0.0281 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0019 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0006 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0004 secs
  resp wait:	0.0143 secs, 0.0037 secs, 0.1462 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0009 secs

Status code distribution:
  [200]	104398 responses