loadtest/results/ballerina-post.txt

Summary:
  Total:	20.0034 secs
  Slowest:	0.1015 secs
  Fastest:	0.0005 secs
  Average:	0.0029 secs
  Requests/sec:	1545.9387
  

Response time histogram:
  0.000 [1]	|
  0.011 [30724]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.021 [175]	|
  0.031 [10]	|
  0.041 [4]	|
  0.051 [0]	|
  0.061 [0]	|
  0.071 [0]	|
  0.081 [0]	|
  0.091 [0]	|
  0.101 [9]	|


Latency distribution:
  10%% in 0.0017 secs
  25%% in 0.0021 secs
  50%% in 0.0022 secs
  75%% in 0.0032 secs
  90%% in 0.0049 secs
  95%% in 0.0061 secs
  99%% in 0.0095 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0008 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0004 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0020 secs
  resp wait:	0.0029 secs, 0.0004 secs, 0.1007 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0004 secs

Status code distribution:
  [201]	30923 responses

Error distribution:
  [1]	Post "http://localhost:8081/api/v1/posts": context deadline exceeded (Client.Timeout exceeded while awaiting headers)