loadtest/results/ballerina-post.txt

Summary:
  Total:	10.0027 secs
  Slowest:	0.0855 secs
  Fastest:	0.0005 secs
  Average:	0.0032 secs
  Requests/sec:	3089.7514
  

Response time histogram:
  0.001 [1]	|
  0.009 [29080]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.018 [1174]	|■■
  0.026 [354]	|
  0.035 [146]	|
  0.043 [77]	|
  0.052 [35]	|
  0.060 [16]	|
  0.068 [17]	|
  0.077 [5]	|
  0.085 [1]	|


Latency distribution:
  10%% in 0.0015 secs
  25%% in 0.0016 secs
  50%% in 0.0017 secs
  75%% in 0.0028 secs
  90%% in 0.0059 secs
  95%% in 0.0102 secs
  99%% in 0.0256 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0008 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0005 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0003 secs
  resp wait:	0.0032 secs, 0.0005 secs, 0.0855 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0003 secs

Status code distribution:
  [201]	30906 responses