loadtest/results/bun-get.txt

Summary:
  Total:	30.0032 secs
  Slowest:	0.0124 secs
  Fastest:	0.0019 secs
  Average:	0.0033 secs
  Requests/sec:	15274.3516
  
  Total data:	1067334120 bytes
  Size/request:	2329 bytes

Response time histogram:
  0.002 [1]	|
  0.003 [12904]	|■
  0.004 [435068]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.005 [1724]	|
  0.006 [903]	|
  0.007 [7359]	|■
  0.008 [279]	|
  0.009 [22]	|
  0.010 [9]	|
  0.011 [9]	|
  0.012 [2]	|


Latency distribution:
  10%% in 0.0031 secs
  25%% in 0.0031 secs
  50%% in 0.0032 secs
  75%% in 0.0033 secs
  90%% in 0.0034 secs
  95%% in 0.0036 secs
  99%% in 0.0063 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0036 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0018 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0012 secs
  resp wait:	0.0033 secs, 0.0010 secs, 0.0124 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0015 secs

Status code distribution:
  [200]	458280 responses