loadtest/results/go-get.txt

Summary:
  Total:	30.0060 secs
  Slowest:	0.0402 secs
  Fastest:	0.0019 secs
  Average:	0.0116 secs
  Requests/sec:	4327.0714
  

Response time histogram:
  0.002 [1]	|
  0.006 [5093]	|■■■■
  0.010 [40047]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.013 [47846]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.017 [24647]	|■■■■■■■■■■■■■■■■■■■■■
  0.021 [8909]	|■■■■■■■
  0.025 [2500]	|■■
  0.029 [586]	|
  0.033 [168]	|
  0.036 [32]	|
  0.040 [9]	|


Latency distribution:
  10%% in 0.0069 secs
  25%% in 0.0086 secs
  50%% in 0.0110 secs
  75%% in 0.0139 secs
  90%% in 0.0170 secs
  95%% in 0.0191 secs
  99%% in 0.0236 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0059 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0011 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0008 secs
  resp wait:	0.0115 secs, 0.0019 secs, 0.0402 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0008 secs

Status code distribution:
  [200]	129838 responses