loadtest/results/go-post.txt

Summary:
  Total:	10.0015 secs
  Slowest:	0.0379 secs
  Fastest:	0.0004 secs
  Average:	0.0025 secs
  Requests/sec:	4033.6122
  
  Total data:	5390327 bytes
  Size/request:	133 bytes

Response time histogram:
  0.000 [1]	|
  0.004 [35772]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.008 [4265]	|■■■■■
  0.012 [195]	|
  0.015 [37]	|
  0.019 [38]	|
  0.023 [25]	|
  0.027 [5]	|
  0.030 [2]	|
  0.034 [0]	|
  0.038 [2]	|


Latency distribution:
  10%% in 0.0010 secs
  25%% in 0.0014 secs
  50%% in 0.0021 secs
  75%% in 0.0031 secs
  90%% in 0.0043 secs
  95%% in 0.0052 secs
  99%% in 0.0074 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0008 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0004 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0025 secs, 0.0004 secs, 0.0379 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0005 secs

Status code distribution:
  [201]	40342 responses