loadtest/results/java-get.txt

Summary:
  Total:	30.0095 secs
  Slowest:	0.0427 secs
  Fastest:	0.0024 secs
  Average:	0.0111 secs
  Requests/sec:	4502.8124
  

Response time histogram:
  0.002 [1]	|
  0.006 [293]	|
  0.010 [53793]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.015 [78115]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.019 [2300]	|■
  0.023 [416]	|
  0.027 [93]	|
  0.031 [53]	|
  0.035 [35]	|
  0.039 [17]	|
  0.043 [11]	|


Latency distribution:
  10%% in 0.0082 secs
  25%% in 0.0087 secs
  50%% in 0.0121 secs
  75%% in 0.0127 secs
  90%% in 0.0132 secs
  95%% in 0.0137 secs
  99%% in 0.0161 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0018 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0007 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0111 secs, 0.0023 secs, 0.0411 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0008 secs

Status code distribution:
  [200]	135127 responses