loadtest/results/java-post.txt

Summary:
  Total:	10.0029 secs
  Slowest:	0.0577 secs
  Fastest:	0.0005 secs
  Average:	0.0031 secs
  Requests/sec:	3214.0796
  
  Total data:	4275950 bytes
  Size/request:	133 bytes

Response time histogram:
  0.001 [1]	|
  0.006 [31848]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.012 [183]	|
  0.018 [39]	|
  0.023 [13]	|
  0.029 [22]	|
  0.035 [11]	|
  0.041 [5]	|
  0.046 [0]	|
  0.052 [1]	|
  0.058 [27]	|


Latency distribution:
  10%% in 0.0026 secs
  25%% in 0.0027 secs
  50%% in 0.0028 secs
  75%% in 0.0031 secs
  90%% in 0.0037 secs
  95%% in 0.0044 secs
  99%% in 0.0061 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0007 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0004 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0031 secs, 0.0005 secs, 0.0571 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [201]	32150 responses