loadtest/results/node-get.txt

Summary:
  Total:	30.0059 secs
  Slowest:	0.1747 secs
  Fastest:	0.0009 secs
  Average:	0.0064 secs
  Requests/sec:	7849.4247
  
  Total data:	548547041 bytes
  Size/request:	2329 bytes

Response time histogram:
  0.001 [1]	|
  0.018 [235431]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.036 [70]	|
  0.053 [4]	|
  0.070 [4]	|
  0.088 [4]	|
  0.105 [3]	|
  0.123 [3]	|
  0.140 [3]	|
  0.157 [3]	|
  0.175 [3]	|


Latency distribution:
  10%% in 0.0058 secs
  25%% in 0.0058 secs
  50%% in 0.0059 secs
  75%% in 0.0060 secs
  90%% in 0.0073 secs
  95%% in 0.0105 secs
  99%% in 0.0119 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0053 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0013 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0003 secs
  resp wait:	0.0064 secs, 0.0009 secs, 0.1682 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0008 secs

Status code distribution:
  [200]	235529 responses