loadtest/results/python-get.txt

Summary:
  Total:	30.0238 secs
  Slowest:	0.0521 secs
  Fastest:	0.0175 secs
  Average:	0.0347 secs
  Requests/sec:	1439.6555
  
  Total data:	100668696 bytes
  Size/request:	2329 bytes

Response time histogram:
  0.018 [1]	|
  0.021 [4]	|
  0.024 [9]	|
  0.028 [16]	|
  0.031 [712]	|■
  0.035 [24364]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.038 [16822]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.042 [654]	|■
  0.045 [271]	|
  0.049 [322]	|■
  0.052 [49]	|


Latency distribution:
  10%% in 0.0327 secs
  25%% in 0.0336 secs
  50%% in 0.0345 secs
  75%% in 0.0355 secs
  90%% in 0.0366 secs
  95%% in 0.0375 secs
  99%% in 0.0447 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0058 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0020 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0006 secs
  resp wait:	0.0347 secs, 0.0117 secs, 0.0521 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0023 secs

Status code distribution:
  [200]	43224 responses