loadtest/results/python-post.txt

Summary:
  Total:	10.0056 secs
  Slowest:	0.0919 secs
  Fastest:	0.0256 secs
  Average:	0.0369 secs
  Requests/sec:	271.2489
  
  Total data:	357250 bytes
  Size/request:	131 bytes

Response time histogram:
  0.026 [1]	|
  0.032 [186]	|■■■■
  0.039 [2001]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.045 [499]	|■■■■■■■■■■
  0.052 [17]	|
  0.059 [0]	|
  0.065 [0]	|
  0.072 [6]	|
  0.079 [1]	|
  0.085 [1]	|
  0.092 [2]	|


Latency distribution:
  10%% in 0.0337 secs
  25%% in 0.0345 secs
  50%% in 0.0368 secs
  75%% in 0.0386 secs
  90%% in 0.0402 secs
  95%% in 0.0417 secs
  99%% in 0.0456 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0009 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0004 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0355 secs, 0.0226 secs, 0.0858 secs
  resp read:	0.0013 secs, 0.0000 secs, 0.0099 secs

Status code distribution:
  [201]	2714 responses