loadtest/results/rust-get.txt

Summary:
  Total:	30.0051 secs
  Slowest:	0.0284 secs
  Fastest:	0.0003 secs
  Average:	0.0076 secs
  Requests/sec:	6611.9671
  
  Total data:	462057297 bytes
  Size/request:	2329 bytes

Response time histogram:
  0.000 [1]	|
  0.003 [2095]	|■
  0.006 [48270]	|■■■■■■■■■■■■■■■■■■■■■
  0.009 [92309]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.012 [41271]	|■■■■■■■■■■■■■■■■■■
  0.014 [10970]	|■■■■■
  0.017 [2633]	|■
  0.020 [622]	|
  0.023 [174]	|
  0.026 [31]	|
  0.028 [17]	|


Latency distribution:
  10%% in 0.0047 secs
  25%% in 0.0059 secs
  50%% in 0.0072 secs
  75%% in 0.0092 secs
  90%% in 0.0110 secs
  95%% in 0.0124 secs
  99%% in 0.0155 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0047 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0018 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0008 secs
  resp wait:	0.0075 secs, 0.0003 secs, 0.0283 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0003 secs

Status code distribution:
  [200]	198393 responses