loadtest/results/rust-post.txt

Summary:
  Total:	10.0022 secs
  Slowest:	0.0534 secs
  Fastest:	0.0004 secs
  Average:	0.0025 secs
  Requests/sec:	3993.4258
  
  Total data:	5301472 bytes
  Size/request:	132 bytes

Response time histogram:
  0.000 [1]	|
  0.006 [39725]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.011 [161]	|
  0.016 [20]	|
  0.022 [13]	|
  0.027 [4]	|
  0.032 [6]	|
  0.037 [3]	|
  0.043 [0]	|
  0.048 [3]	|
  0.053 [7]	|


Latency distribution:
  10%% in 0.0022 secs
  25%% in 0.0023 secs
  50%% in 0.0024 secs
  75%% in 0.0025 secs
  90%% in 0.0028 secs
  95%% in 0.0031 secs
  99%% in 0.0038 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0009 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0004 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0025 secs, 0.0003 secs, 0.0534 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0005 secs

Status code distribution:
  [201]	39943 responses